Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public virtual void Append(
	CurveArray item
)
  Visual Basic
Public Overridable Sub Append ( _
	item As CurveArray _
)
  Visual C++
public:
virtual void Append(
	CurveArray^ item
)
 Parameters
  item
 Type:  Autodesk.Revit.DB CurveArray
 See Also
  CurveArrArray Class
  Autodesk.Revit.DB Namespace